# Краткая инструкция по работе с GIT (продолжение 2)

## Полезные команды (для синхронизации с GitHub):

1. **git clone** - команда, выполняющая клонирование чужого репозитория. После нее нужно указать ссылку на репозиторий (ее можно взять с GitHub, нажав на кнопку *Code*).

Альтернативный вариант клонирования - открыть в VS код новое окно, там нажать на "деревце" слева и нажать на кнопку *Клонировать репозиторий". 

2. **git push** - команда, отправляющая изменения в репозитории на сайт Github. Отправлять можно только после сохранения файла, выполнения команды git add и git commit.

3. **git pull** - команда, позволяющая "забрать" изменения с Github, если они там производились после отправки (push) репозитория на сайт. Git pull сразу будет делать merge, автоматически.

## Как создать удаленный репозиторий?

**Удаленный репозиторий** (remote repository) - это репозиторий, созданный не на локальном компьютере. В основном удаленные репозитории создают на сайте GitHub. 

Создать удаленный репозиторий можно путем 

* добавления нового (на сайте GitHub - + New repository) 
* либо клонирования чужого (в данном случае используется кнопка **fork**). 

В первом случае после создания репозитория на сайте придерживаемся инструкции, описанной на сайте GitHub, - копируем команды и ссылки из блока "...or push an existing repository" и вставляем в терминал (чтобы добавить себе на локальный компьютер созданный удаленный репозиторий).

Во втором случае для добавления чужого репозиторий к себе используем команду **git clone** или кнопку **Клонировать репозиторий**.